# ë„¤íŠ¸ì›Œí¬ ì—”ì§€ë‹ˆì–´ í•™ìŠµ ë…¸íŠ¸

> **ì‘ì„±ì**: ê¹€ë¬´ì¼    
> **ê¸°ê°„**: 2025.03.17 ~   
> **ë„êµ¬**: Cisco Packet Tracer    
> **ëª©í‘œ**: ì‹¤ë¬´ ëŠ¥ë ¥ í–¥ìƒ  

---

## 1. ë„¤íŠ¸ì›Œí¬ ê¸°ë³¸ êµ¬ì¡° ë° ê°œë… ì •ë¦¬
### IP Address Classes
N : Network number   
H : Host number
- **class A :** N  H  H  H /8
- **class B :** N  N  H  H /16
- **class C :** N  N  N  H /24
- **class D :** for multicast
- **class A :** for research
### IP Address Bit Patterns
- **class A :** 00000000.        .        .        /8      0~127
- **class B :** 10000000.        .        .        /16     128~191
- **class C :** 11000000.        .        .        /24     192~223
- **class D :** 11100000.                                  224   
  â€»127ì€ ì•ˆì“´ë‹¤ ì‹œìŠ¤í…œì— ì‚¬ìš©í•œë‹¤.
- **ì‚¬ì„¤ IP**
   
  10.0.0.0 ~ 10.255.255.255 (10.0.0.0/8)   
  172.16.0.0 ~ 172.31.255.255.(172.16.0.0/12)   
  192.168.0.0 ~ 192.168.255.255 (192.168.0.0/16)

### VLAN
- ë¶€ì„œë³„ë¡œ í†µì‹ ì„ ë¶„ë¦¬í•˜ì—¬ ë„¤íŠ¸ì›Œí¬ íš¨ìœ¨ì„±ì„ ì¦ê°€ì‹œí‚¤ëŠ” ê¸°ìˆ 


---

## 2. Packet Tracer ì‹¤ìŠµ ë‚´ìš© ì •ë¦¬

### [ì‹¤ìŠµ 1] ì¥ë¹„ ì´ˆê¸°ê°’
- **ëª©í‘œ**: ì¥ë¹„ë“¤ì˜ ì´ˆê¸°ê°’ ì£¼ê¸°   
- **êµ¬ì„±ë„**   
    - ë¼ìš°í„° 1ëŒ€   
```bash
Router>en                                     //ê´€ë¦¬ì ëª¨ë“œë¡œ ì „í™˜
Router#configure terminal                     //ì‹œìŠ¤ì½” ì¥ë¹„ ì„¤ì •ì„ ì‹œì‘
Router(config)#line console 0                 //ì½˜ì†” í¬íŠ¸ ì„¤ì •ì„ ì‹œì‘
Router(config-line)#exec-timeout 0 0          //ë¹„í™œì„± ìƒíƒœì¼ ê²½ìš° ìë™ ë¡œê·¸ì•„ì›ƒë˜ì§€ ì•Šë„ë¡ ì„¤ì •
Router(config-line)#logging synchronous       //ë°±ê·¸ë¼ìš´ë“œì—ì„œ ë°œìƒí•˜ëŠ” ì‹œìŠ¤í…œ ë©”ì„¸ì§€ë¡œ ì¸í•˜ì—¬ ì…ë ¥í•˜ë˜ ëª…ë ¹ì–´ê°€ ëŠê¸°ì§€ ì•Šê²Œ í•œë‹¤.
Router(config-line)#exit                      //í˜„ ìƒíƒœì—ì„œ ë°–ìœ¼ë¡œ ë‚˜ê°€ê¸°
Router(config)#no ip domain lookup            //ëª¨ë¥´ëŠ” ëª…ë ¹ì–´ë¥¼ ë„ë©”ì¸ì´ ë” ì´ìƒ ê²€ìƒ‰í•˜ì§€ ì•ŠëŠ”ë‹¤.
Router(config)#exit                           //í˜„ ìƒíƒœì—ì„œ ë°–ìœ¼ë¡œ ë‚˜ê°€ê¸°
Router#copy running-config startup-config     //ì €ì¥ ëª…ë ¹ì–´
```
### [ì‹¤ìŠµ 2] ë°±ì—… ë°©ë²•
- **ëª©í‘œ**: ì¥ë¹„ë“¤ ë°±ì—…  
- **êµ¬ì„±ë„**   
    - ë¼ìš°í„° 1ëŒ€, TFTPì„œë²„ 1ëŒ€   
- **ë°©ë²• 1**
```bash
Router#copy running-config tftp:
Address or name of remote host[]? ì˜ˆì‹œ)192.168.1.10               // (TFTPì„œë²„ ì£¼ì†Œ ê°’)
Destination filename [Router-config]? ì˜ˆì‹œ)Router-20250317-config // (íŒŒì¼ ì´ë¦„ ì„¤ì •)
```
- **ë°©ë²• 2**
```bash
Router#copy running-config flash:
Destination filename [running-config]? ì˜ˆì‹œ)20250317-config       // (íŒŒì¼ ì´ë¦„ ì„¤ì •)
Building configuration...
[ok]
//ë°±ì—… í•˜ê¸°
Router#copy flash: running-config
Source filename[]? ì˜ˆì‹œ)20250317-config
```
- **ë°©ë²• 3**
  - ë©”ë³´ì¥ì— running-configë¥¼ ë³µì‚¬í•´ì„œ ë¶™ì—¬ë„£ê¸°

---

### [ì‹¤ìŠµ3] Subnetting (ì„œë¸Œë„·íŒ…)

- **ì •ì˜**: í•˜ë‚˜ì˜ IP ë„¤íŠ¸ì›Œí¬ë¥¼ ì—¬ëŸ¬ ê°œì˜ ì†Œê·œëª¨ ë„¤íŠ¸ì›Œí¬(ì„œë¸Œë„·)ë¡œ ë‚˜ëˆ„ëŠ” ê¸°ìˆ   
- **í•„ìš”ì„±**
  - IP ìì› ì ˆì•½
  - ë„¤íŠ¸ì›Œí¬ ì„±ëŠ¥ í–¥ìƒ
  - ë³´ì•ˆ ë° íŠ¸ë˜í”½ ê´€ë¦¬ ìš©ì´

###  ì„œë¸Œë„· ë§ˆìŠ¤í¬ ì˜ˆì‹œ

| ì„œë¸Œë„· ë§ˆìŠ¤í¬          | í”„ë¦¬í”½ìŠ¤ | ì‚¬ìš© ê°€ëŠ¥í•œ í˜¸ìŠ¤íŠ¸ ìˆ˜ | ì„œë¸Œë„· ìˆ˜ (Class C ê¸°ì¤€) |
|------------------------|----------|------------------------|---------------------------|
| 255.255.255.0          | /24      | 254 (2â¸ - 2)           | 1                         |
| 255.255.255.192        | /26      | 62 (2â¶ - 2)            | 4                         |
| 255.255.255.240        | /28      | 14 (2â´ - 2)            | 16                        |
| 255.255.255.252        | /30      | 2 (2Â² - 2)             | 64                        |

### ğŸ§® ê³„ì‚° ê³µì‹
- **í˜¸ìŠ¤íŠ¸ ìˆ˜ ê³„ì‚°**: 2â¿ - 2 (n = í˜¸ìŠ¤íŠ¸ ë¹„íŠ¸ ìˆ˜)
- **ì„œë¸Œë„· ìˆ˜ ê³„ì‚°**: 2â¿ (n = ë¹Œë¦° ë¹„íŠ¸ ìˆ˜)

---

### [ì‹¤ìŠµ4] CIDR (Classless Inter-Domain Routing)

- **ì •ì˜**: í´ë˜ìŠ¤ êµ¬ë¶„ ì—†ì´ ë„¤íŠ¸ì›Œí¬ ì£¼ì†Œë¥¼ `/í”„ë¦¬í”½ìŠ¤` í˜•ì‹ìœ¼ë¡œ í‘œí˜„í•˜ëŠ” ë°©ì‹  
- **í˜•ì‹ ì˜ˆì‹œ**
  - `192.168.1.0/24`: ì¼ë°˜ì ì¸ Class C
  - `192.168.1.0/28`: ì„œë¸Œë„·íŒ…ëœ ì£¼ì†Œ
  - `10.0.0.0/8`: ëŒ€ê·œëª¨ ë„¤íŠ¸ì›Œí¬ í• ë‹¹

###  ì¥ì 
- ìœ ì—°í•œ IP ì£¼ì†Œ í• ë‹¹
- ì£¼ì†Œ ê³µê°„ ì ˆì•½
- ë¼ìš°íŒ… í…Œì´ë¸” ì¶•ì†Œ (ìš”ì•½ ê°€ëŠ¥)

---

### [ì‹¤ìŠµ5] Loopback
- **ì •ì˜**: ë…¼ë¦¬ì  ì¸í„°í˜ì´ìŠ¤ë¥¼ ì˜ë¯¸ (ì‹¤ì œ ì¡´ì¬í•˜ì§€ ì•ŠëŠ” ì¸í„°í˜ì´ìŠ¤)
- **í•„ìš”ì„±**
  - ë¼ìš°íŒ… ì‹¤ìŠµì‹œ ë„¤íŠ¸ì›Œí¬ë¥¼ ì¶”ê°€ë¡œ ë§Œë“¤ê¸° ìœ„í•´ ì‚¬ìš©
  - ë¼ìš°í„°ê°€ ë‹¤ìš´ë˜ì§€ ì•ŠëŠ”í•œ ì¸í„°í˜ì´ìŠ¤ëŠ” ê³„ì† UP ìƒíƒœ ìœ ì§€ (ì•ˆì •ì , íŠ¼íŠ¼í•¨)
  - ë¼ìš°íŒ… í”„ë¡œí† ì½œì—ì„œ router-id ì‚¬ìš©
  - ì¥ë¹„ìì²´ í…ŒìŠ¤íŠ¸ìš©
  - 
###  Loopback í™œìš© ì˜ˆì‹œ
ì„¤ì • ip ê°’ : 1.1.1.1/24
```base
Router(config)# int lookback0
Router(config-if)# ip add 1.1.1.1 255.255.255.0

#ì‚­ì œ ê°€ëŠ¥
Router(config)# no loopback0
```
---

## [ì‹¤ìŠµ6] ACL (Access Control List)

### ACLì´ë€?
> **Access Control List**ëŠ” ë„¤íŠ¸ì›Œí¬ ì¥ë¹„(Router ë“±)ì—ì„œ íŠ¸ë˜í”½ íë¦„ì„ ì œì–´í•˜ê¸° ìœ„í•œ í•„í„°ë§ ê¸°ìˆ    
>  ì£¼ë¡œ **ë³´ì•ˆ ì •ì±… ì ìš©**, **ì ‘ê·¼ ì œí•œ**, **íŠ¸ë˜í”½ ì œì–´**ì— ì‚¬ìš©

---

## [ì‹¤ìŠµ6-1] Standard Access List

###  íŠ¹ì§•
- **ì¶œë°œì§€ IP ì£¼ì†Œë§Œ** ê¸°ì¤€ìœ¼ë¡œ í•„í„°ë§
- ë²ˆí˜¸ ë²”ìœ„: **1~99** ë˜ëŠ” **1300~1999**
- ì¼ë°˜ì ìœ¼ë¡œ **ëª©ì ì§€ ê°€ê¹Œìš´ ìª½** ì¸í„°í˜ì´ìŠ¤ì— ì ìš©

###  ì„¤ì • ì˜ˆì‹œ  
> 192.168.10.0/24 ë„¤íŠ¸ì›Œí¬ì—ì„œë§Œ ì ‘ê·¼ì„ í—ˆìš©í•˜ê³ , ë‚˜ë¨¸ì§€ëŠ” ì°¨ë‹¨

```bash
Router(config)# access-list 10 permit 192.168.10.0 0.0.0.255
Router(config)# access-list 10 deny any
Router(config)# interface fastEthernet 0/0
Router(config-if)# ip access-group 10 in
```

---

## [ì‹¤ìŠµ6-2] Extended Access List

###  íŠ¹ì§•
- **ì¶œë°œì§€ IP, ëª©ì ì§€ IP, í”„ë¡œí† ì½œ(TCP, UDP ë“±), í¬íŠ¸ ë²ˆí˜¸**ê¹Œì§€ ìƒì„¸í•˜ê²Œ ì œì–´í•¨
- ë²ˆí˜¸ ë²”ìœ„: **100~199** ë˜ëŠ” **2000~2699**
- ì¼ë°˜ì ìœ¼ë¡œ **ì¶œë°œì§€ ê°€ê¹Œìš´ ìª½** ì¸í„°í˜ì´ìŠ¤ì— ì ìš©

###  ì„¤ì • ì˜ˆì‹œ  
> 192.168.20.0/24 ë„¤íŠ¸ì›Œí¬ì—ì„œ ì¶œë°œí•œ HTTP(80ë²ˆ í¬íŠ¸) íŠ¸ë˜í”½ë§Œ í—ˆìš©í•˜ê³ , ë‚˜ë¨¸ì§€ëŠ” ì°¨ë‹¨

```bash
Router(config)# access-list 110 permit tcp 192.168.20.0 0.0.0.255 any eq 80
Router(config)# access-list 110 deny ip any any
Router(config)# interface fastEthernet 0/1
Router(config-if)# ip access-group 110 in
```
---

## [ì‹¤ìŠµ7] VLAN (Virtual LAN)

### VLANì´ë€?
> **VLAN (Virtual Local Area Network)**ì€ í•˜ë‚˜ì˜ ë¬¼ë¦¬ì  ë„¤íŠ¸ì›Œí¬ë¥¼ ë…¼ë¦¬ì ìœ¼ë¡œ ì—¬ëŸ¬ ê°œì˜ ê°€ìƒ ë„¤íŠ¸ì›Œí¬ë¡œ ë¶„í• í•˜ëŠ” ê¸°ìˆ   
> ë„¤íŠ¸ì›Œí¬ë¥¼ ë¶€ì„œë³„, ê¸°ëŠ¥ë³„ë¡œ êµ¬ë¶„í•˜ì—¬ ë³´ì•ˆì„±ê³¼ íš¨ìœ¨ì„±ì„ ë†’ì„


### VLANì˜ ì¥ì 
- ë¸Œë¡œë“œìºìŠ¤íŠ¸ ë„ë©”ì¸ ë¶„ë¦¬
- ë³´ì•ˆ ê°•í™”
- íŠ¸ë˜í”½ ê°ì†Œ
- ê´€ë¦¬ íš¨ìœ¨ì„± í–¥ìƒ


### ì‹¤ìŠµ ëª©í‘œ
- VLAN ìƒì„± ë° í¬íŠ¸ ì§€ì •
- PC ê°„ í†µì‹  í…ŒìŠ¤íŠ¸


### êµ¬ì„±ë„
- **ìŠ¤ìœ„ì¹˜ 1ëŒ€**
- **PC 2ëŒ€**
- **VLAN 10 (ì˜ˆ: Sales)**  
- **VLAN 20 (ì˜ˆ: HR)**


### ì„¤ì • ëª…ë ¹ì–´ (ìŠ¤ìœ„ì¹˜ ê¸°ì¤€)

```bash
Switch> enable

! VLAN ìƒì„± (vlan database ëª…ë ¹ì–´ ì‚¬ìš©)
Switch# vlan database
Switch(vlan)# vlan 10 name Sales
Switch(vlan)# vlan 20 name HR
Switch(vlan)# exit

! í¬íŠ¸ VLAN ì§€ì •
Switch# conf t
Switch(config)# int fa 0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# exit

Switch(config)# int fa 0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 20
Switch(config-if)# exit

! ì„¤ì • í™•ì¸
Switch# show vlan brief
```

### í†µì‹  í…ŒìŠ¤íŠ¸
- **ê°™ì€ VLANë¼ë¦¬** í†µì‹  â†’ ê°€ëŠ¥í•´ì•¼ í•¨
- **ë‹¤ë¥¸ VLANë¼ë¦¬** í†µì‹  â†’ ë¼ìš°í„°ë‚˜ L3 ìŠ¤ìœ„ì¹˜ ì„¤ì • ì—†ì´ëŠ” ë¶ˆê°€ (â†’ **Inter-VLAN Routing í•„ìš”**)

---


## [ì‹¤ìŠµ8] Trunk ì„¤ì •

### Trunkë€?
> **Trunk í¬íŠ¸**ëŠ” ì—¬ëŸ¬ VLANì˜ íŠ¸ë˜í”½ì„ í•˜ë‚˜ì˜ í¬íŠ¸ë¥¼ í†µí•´ ì „ë‹¬í•˜ê¸° ìœ„í•œ ì„¤ì •  
> ì£¼ë¡œ **ìŠ¤ìœ„ì¹˜ ê°„** VLAN ì •ë³´ë¥¼ ìœ ì§€í•˜ë©° ì—°ê²°í•  ë•Œ ì‚¬ìš©ë¨


### Trunkì˜ íŠ¹ì§•
- ê¸°ë³¸ ë™ì‘ í”„ë¡œí† ì½œ: **802.1Q**
- í•˜ë‚˜ì˜ í¬íŠ¸ì—ì„œ **ì—¬ëŸ¬ VLANì˜ í”„ë ˆì„**ì„ íƒœê¹…í•˜ì—¬ ì „ì†¡
- Native VLANì€ ê¸°ë³¸ì ìœ¼ë¡œ **VLAN 1**


### ì‹¤ìŠµ ëª©í‘œ
- ìŠ¤ìœ„ì¹˜ ê°„ ì—°ê²° í¬íŠ¸ë¥¼ Trunkë¡œ ì„¤ì •
- VLAN ì •ë³´ê°€ ì˜¬ë°”ë¥´ê²Œ ì „ë‹¬ë˜ëŠ”ì§€ í™•ì¸


### êµ¬ì„±ë„
- **ìŠ¤ìœ„ì¹˜ 2ëŒ€**
- **PC 2ëŒ€ (ê° VLANì— ì—°ê²°)**  
- **VLAN 10: Sales**, **VLAN 20: HR**


### ì„¤ì • ëª…ë ¹ì–´

```bash
Switch1> enable
Switch1# configure terminal

! í¬íŠ¸ Trunk ì„¤ì • (ìŠ¤ìœ„ì¹˜ ê°„ ì—°ê²° í¬íŠ¸)
Switch1(config)# interface fastEthernet 0/24
Switch1(config-if)# switchport mode trunk
Switch1(config-if)# switchport trunk encapsulation dot1q   // (í•„ìš” ì‹œ)
Switch1(config-if)# exit

! VLAN ìƒì„±
Switch1# vlan database
Switch1(vlan)# vlan 10 name Sales
Switch1(vlan)# vlan 20 name HR
Switch1(vlan)# exit

! PC ì—°ê²° í¬íŠ¸ì— VLAN í• ë‹¹
Switch1(config)# interface fastEthernet 0/1
Switch1(config-if)# switchport mode access
Switch1(config-if)# switchport access vlan 10
Switch1(config-if)# exit
```

```bash
Switch2> enable
Switch2# configure terminal

! í¬íŠ¸ Trunk ì„¤ì •
Switch2(config)# interface fastEthernet 0/24
Switch2(config-if)# switchport mode trunk
Switch2(config-if)# switchport trunk encapsulation dot1q   // (í•„ìš” ì‹œ)
Switch2(config-if)# exit

! VLAN ìƒì„±
Switch2# vlan database
Switch2(vlan)# vlan 10 name Sales
Switch2(vlan)# vlan 20 name HR
Switch2(vlan)# exit

! PC ì—°ê²° í¬íŠ¸ì— VLAN í• ë‹¹
Switch2(config)# interface fastEthernet 0/2
Switch2(config-if)# switchport mode access
Switch2(config-if)# switchport access vlan 10
Switch2(config-if)# exit
```


### í†µì‹  í…ŒìŠ¤íŠ¸
- **ê°™ì€ VLAN (ì˜ˆ: VLAN 10)**ì— ì†í•œ PCëŠ” **ìŠ¤ìœ„ì¹˜ê°€ ë‹¬ë¼ë„ í†µì‹  ê°€ëŠ¥**
- **ë‹¤ë¥¸ VLAN**ì€ Trunkë§Œìœ¼ë¡œ í†µì‹  ë¶ˆê°€ â†’ **ë¼ìš°íŒ… í•„ìš” (Inter-VLAN Routing)**


### Trunk ì„¤ì • í™•ì¸
```bash
Switch# show interfaces trunk
```
---

## [ì‹¤ìŠµ9] VTP (VLAN Trunking Protocol)

### VTPë€?
> **VTP (VLAN Trunking Protocol)**ì€ ìŠ¤ìœ„ì¹˜ ê°„ VLAN ì •ë³´ë¥¼ **ìë™ìœ¼ë¡œ ê³µìœ **í•˜ê¸° ìœ„í•œ Cisco ë…ì í”„ë¡œí† ì½œ  
> VLAN ì •ë³´ë¥¼ ìˆ˜ë™ìœ¼ë¡œ ë°˜ë³µ ìƒì„±í•  í•„ìš” ì—†ì´ **ì¤‘ì•™ì—ì„œ ê´€ë¦¬**


### VTPì˜ ë™ì‘ ëª¨ë“œ
| ëª¨ë“œ        | ì„¤ëª… |
|-------------|------|
| **Server**  | VLAN ìƒì„±/ìˆ˜ì • ê°€ëŠ¥, ë‹¤ë¥¸ ìŠ¤ìœ„ì¹˜ì— ì •ë³´ ë°°í¬ |
| **Client**  | VLAN ìƒì„±/ìˆ˜ì • ë¶ˆê°€, ì„œë²„ë¡œë¶€í„° ì •ë³´ ìˆ˜ì‹  |
| **Transparent** | ë‹¤ë¥¸ ìŠ¤ìœ„ì¹˜ë¡œ VTP ì •ë³´ ì „ë‹¬ë§Œ, ìì²´ VLANì€ ë…ë¦½ ê´€ë¦¬ |


### ì‹¤ìŠµ ëª©í‘œ
- VTP Server/Client ì„¤ì •
- VLAN ì •ë³´ê°€ ìë™ìœ¼ë¡œ ë™ê¸°í™”ë˜ëŠ”ì§€ í™•ì¸


### êµ¬ì„±ë„
- **ìŠ¤ìœ„ì¹˜ 2ëŒ€**
- ìŠ¤ìœ„ì¹˜ ê°„ **Trunk ì—°ê²°**
- VTP Domain: `MYNETWORK`


### ì„¤ì • ëª…ë ¹ì–´

```bash
! === Switch1 (VTP Server ì—­í• ) ===
Switch1> enable
Switch1# configure terminal
Switch1(config)# vtp mode server
Switch1(config)# vtp domain MYNETWORK
Switch1(config)# vtp password cisco
Switch1(config)# exit

! VLAN ìƒì„±
Switch1# vlan database
Switch1(vlan)# vlan 10 name Sales
Switch1(vlan)# vlan 20 name HR
Switch1(vlan)# exit
```

```bash
! === Switch2 (VTP Client ì—­í• ) === !
Switch2> enable
Switch2# configure terminal
Switch2(config)# vtp mode client
Switch2(config)# vtp domain MYNETWORK
Switch2(config)# vtp password cisco
Switch2(config)# exit
```

### ì£¼ì˜ì‚¬í•­
- VTP domain, ë¹„ë°€ë²ˆí˜¸, ë²„ì „ì´ ëª¨ë‘ **ë™ì¼í•´ì•¼** ì •ë³´ê°€ ë™ê¸°í™”ë¨
- ë°˜ë“œì‹œ **Trunk í¬íŠ¸ë¡œ ì—°ê²°**ë˜ì–´ ìˆì–´ì•¼ VTP ì‘ë™
- ClientëŠ” VLAN ìƒì„±/ì‚­ì œ ë¶ˆê°€


### í™•ì¸ ëª…ë ¹ì–´

```bash
Switch# show vtp status
Switch# show vlan brief
```


### í…ŒìŠ¤íŠ¸
- Switch1ì—ì„œ VLAN ìƒì„± í›„, Switch2ì— ìë™ìœ¼ë¡œ VLANì´ ë™ê¸°í™”ë˜ëŠ”ì§€ í™•ì¸
- ë™ê¸°í™”ê°€ ë˜ì§€ ì•Šì„ ê²½ìš° â†’ ë„ë©”ì¸/ë¹„ë°€ë²ˆí˜¸/Trunk í™•ì¸



