# ë„¤íŠ¸ì›Œí¬ ì—”ì§€ë‹ˆì–´ í•™ìŠµ ë…¸íŠ¸

> **ì‘ì„±ì**: ê¹€ë¬´ì¼    
> **ê¸°ê°„**: 2025.03.17 ~   
> **ë„êµ¬**: Cisco Packet Tracer    
> **ëª©í‘œ**: ì‹¤ë¬´ ëŠ¥ë ¥ í–¥ìƒ  

---

## 1. ë„¤íŠ¸ì›Œí¬ ê¸°ë³¸ êµ¬ì¡° ë° ê°œë… ì •ë¦¬
### IP Address Classes
N : Network number   
H : Host number
- **class A :** N  H  H  H /8
- **class B :** N  N  H  H /16
- **class C :** N  N  N  H /24
- **class D :** for multicast
- **class A :** for research
### IP Address Bit Patterns
- **class A :** 00000000.        .        .        /8      0~127
- **class B :** 10000000.        .        .        /16     128~191
- **class C :** 11000000.        .        .        /24     192~223
- **class D :** 11100000.                                  224   
  â€»127ì€ ì•ˆì“´ë‹¤ ì‹œìŠ¤í…œì— ì‚¬ìš©í•œë‹¤.
- **ì‚¬ì„¤ IP**
   
  10.0.0.0 ~ 10.255.255.255 (10.0.0.0/8)   
  172.16.0.0 ~ 172.31.255.255.(172.16.0.0/12)   
  192.168.0.0 ~ 192.168.255.255 (192.168.0.0/16)

### VLAN
- ë¶€ì„œë³„ë¡œ í†µì‹ ì„ ë¶„ë¦¬í•˜ì—¬ ë„¤íŠ¸ì›Œí¬ íš¨ìœ¨ì„±ì„ ì¦ê°€ì‹œí‚¤ëŠ” ê¸°ìˆ 


---

## 2. Packet Tracer ì‹¤ìŠµ ë‚´ìš© ì •ë¦¬

### [ì‹¤ìŠµ 1] ì¥ë¹„ ì´ˆê¸°ê°’
- **ëª©í‘œ**: ì¥ë¹„ë“¤ì˜ ì´ˆê¸°ê°’ ì£¼ê¸°   
- **êµ¬ì„±ë„**   
    - ë¼ìš°í„° 1ëŒ€   
```bash
Router>en                                     //ê´€ë¦¬ì ëª¨ë“œë¡œ ì „í™˜
Router#configure terminal                     //ì‹œìŠ¤ì½” ì¥ë¹„ ì„¤ì •ì„ ì‹œì‘
Router(config)#line console 0                 //ì½˜ì†” í¬íŠ¸ ì„¤ì •ì„ ì‹œì‘
Router(config-line)#exec-timeout 0 0          //ë¹„í™œì„± ìƒíƒœì¼ ê²½ìš° ìë™ ë¡œê·¸ì•„ì›ƒë˜ì§€ ì•Šë„ë¡ ì„¤ì •
Router(config-line)#logging synchronous       //ë°±ê·¸ë¼ìš´ë“œì—ì„œ ë°œìƒí•˜ëŠ” ì‹œìŠ¤í…œ ë©”ì„¸ì§€ë¡œ ì¸í•˜ì—¬ ì…ë ¥í•˜ë˜ ëª…ë ¹ì–´ê°€ ëŠê¸°ì§€ ì•Šê²Œ í•œë‹¤.
Router(config-line)#exit                      //í˜„ ìƒíƒœì—ì„œ ë°–ìœ¼ë¡œ ë‚˜ê°€ê¸°
Router(config)#no ip domain lookup            //ëª¨ë¥´ëŠ” ëª…ë ¹ì–´ë¥¼ ë„ë©”ì¸ì´ ë” ì´ìƒ ê²€ìƒ‰í•˜ì§€ ì•ŠëŠ”ë‹¤.
Router(config)#exit                           //í˜„ ìƒíƒœì—ì„œ ë°–ìœ¼ë¡œ ë‚˜ê°€ê¸°
Router#copy running-config startup-config     //ì €ì¥ ëª…ë ¹ì–´
```
### [ì‹¤ìŠµ 2] ë°±ì—… ë°©ë²•
- **ëª©í‘œ**: ì¥ë¹„ë“¤ ë°±ì—…  
- **êµ¬ì„±ë„**   
    - ë¼ìš°í„° 1ëŒ€, TFTPì„œë²„ 1ëŒ€   
- **ë°©ë²• 1**
```bash
Router#copy running-config tftp:
Address or name of remote host[]? ì˜ˆì‹œ)192.168.1.10               // (TFTPì„œë²„ ì£¼ì†Œ ê°’)
Destination filename [Router-config]? ì˜ˆì‹œ)Router-20250317-config // (íŒŒì¼ ì´ë¦„ ì„¤ì •)
```
- **ë°©ë²• 2**
```bash
Router#copy running-config flash:
Destination filename [running-config]? ì˜ˆì‹œ)20250317-config       // (íŒŒì¼ ì´ë¦„ ì„¤ì •)
Building configuration...
[ok]
//ë°±ì—… í•˜ê¸°
Router#copy flash: running-config
Source filename[]? ì˜ˆì‹œ)20250317-config
```
- **ë°©ë²• 3**
  - ë©”ë³´ì¥ì— running-configë¥¼ ë³µì‚¬í•´ì„œ ë¶™ì—¬ë„£ê¸°

---

### [ì‹¤ìŠµ3] Subnetting (ì„œë¸Œë„·íŒ…)

- **ì •ì˜**: í•˜ë‚˜ì˜ IP ë„¤íŠ¸ì›Œí¬ë¥¼ ì—¬ëŸ¬ ê°œì˜ ì†Œê·œëª¨ ë„¤íŠ¸ì›Œí¬(ì„œë¸Œë„·)ë¡œ ë‚˜ëˆ„ëŠ” ê¸°ìˆ   
- **í•„ìš”ì„±**
  - IP ìì› ì ˆì•½
  - ë„¤íŠ¸ì›Œí¬ ì„±ëŠ¥ í–¥ìƒ
  - ë³´ì•ˆ ë° íŠ¸ë˜í”½ ê´€ë¦¬ ìš©ì´

###  ì„œë¸Œë„· ë§ˆìŠ¤í¬ ì˜ˆì‹œ

| ì„œë¸Œë„· ë§ˆìŠ¤í¬          | í”„ë¦¬í”½ìŠ¤ | ì‚¬ìš© ê°€ëŠ¥í•œ í˜¸ìŠ¤íŠ¸ ìˆ˜ | ì„œë¸Œë„· ìˆ˜ (Class C ê¸°ì¤€) |
|------------------------|----------|------------------------|---------------------------|
| 255.255.255.0          | /24      | 254 (2â¸ - 2)           | 1                         |
| 255.255.255.192        | /26      | 62 (2â¶ - 2)            | 4                         |
| 255.255.255.240        | /28      | 14 (2â´ - 2)            | 16                        |
| 255.255.255.252        | /30      | 2 (2Â² - 2)             | 64                        |

### ğŸ§® ê³„ì‚° ê³µì‹
- **í˜¸ìŠ¤íŠ¸ ìˆ˜ ê³„ì‚°**: 2â¿ - 2 (n = í˜¸ìŠ¤íŠ¸ ë¹„íŠ¸ ìˆ˜)
- **ì„œë¸Œë„· ìˆ˜ ê³„ì‚°**: 2â¿ (n = ë¹Œë¦° ë¹„íŠ¸ ìˆ˜)

---

### [ì‹¤ìŠµ4] CIDR (Classless Inter-Domain Routing)

- **ì •ì˜**: í´ë˜ìŠ¤ êµ¬ë¶„ ì—†ì´ ë„¤íŠ¸ì›Œí¬ ì£¼ì†Œë¥¼ `/í”„ë¦¬í”½ìŠ¤` í˜•ì‹ìœ¼ë¡œ í‘œí˜„í•˜ëŠ” ë°©ì‹  
- **í˜•ì‹ ì˜ˆì‹œ**
  - `192.168.1.0/24`: ì¼ë°˜ì ì¸ Class C
  - `192.168.1.0/28`: ì„œë¸Œë„·íŒ…ëœ ì£¼ì†Œ
  - `10.0.0.0/8`: ëŒ€ê·œëª¨ ë„¤íŠ¸ì›Œí¬ í• ë‹¹

###  ì¥ì 
- ìœ ì—°í•œ IP ì£¼ì†Œ í• ë‹¹
- ì£¼ì†Œ ê³µê°„ ì ˆì•½
- ë¼ìš°íŒ… í…Œì´ë¸” ì¶•ì†Œ (ìš”ì•½ ê°€ëŠ¥)

---

### [ì‹¤ìŠµ5] Loopback
- **ì •ì˜**: ë…¼ë¦¬ì  ì¸í„°í˜ì´ìŠ¤ë¥¼ ì˜ë¯¸ (ì‹¤ì œ ì¡´ì¬í•˜ì§€ ì•ŠëŠ” ì¸í„°í˜ì´ìŠ¤)
- **í•„ìš”ì„±**
  - ë¼ìš°íŒ… ì‹¤ìŠµì‹œ ë„¤íŠ¸ì›Œí¬ë¥¼ ì¶”ê°€ë¡œ ë§Œë“¤ê¸° ìœ„í•´ ì‚¬ìš©
  - ë¼ìš°í„°ê°€ ë‹¤ìš´ë˜ì§€ ì•ŠëŠ”í•œ ì¸í„°í˜ì´ìŠ¤ëŠ” ê³„ì† UP ìƒíƒœ ìœ ì§€ (ì•ˆì •ì , íŠ¼íŠ¼í•¨)
  - ë¼ìš°íŒ… í”„ë¡œí† ì½œì—ì„œ router-id ì‚¬ìš©
  - ì¥ë¹„ìì²´ í…ŒìŠ¤íŠ¸ìš©
  - 
###  Loopback í™œìš© ì˜ˆì‹œ
ì„¤ì • ip ê°’ : 1.1.1.1/24
```base
Router(config)# int lookback0
Router(config-if)# ip add 1.1.1.1 255.255.255.0

#ì‚­ì œ ê°€ëŠ¥
Router(config)# no loopback0
```
---

## [ì‹¤ìŠµ6] ACL (Access Control List)

### ACLì´ë€?
> **Access Control List**ëŠ” ë„¤íŠ¸ì›Œí¬ ì¥ë¹„(Router ë“±)ì—ì„œ íŠ¸ë˜í”½ íë¦„ì„ ì œì–´í•˜ê¸° ìœ„í•œ í•„í„°ë§ ê¸°ìˆ    
>  ì£¼ë¡œ **ë³´ì•ˆ ì •ì±… ì ìš©**, **ì ‘ê·¼ ì œí•œ**, **íŠ¸ë˜í”½ ì œì–´**ì— ì‚¬ìš©

---

## [ì‹¤ìŠµ6-1] Standard Access List

###  íŠ¹ì§•
- **ì¶œë°œì§€ IP ì£¼ì†Œë§Œ** ê¸°ì¤€ìœ¼ë¡œ í•„í„°ë§
- ë²ˆí˜¸ ë²”ìœ„: **1~99** ë˜ëŠ” **1300~1999**
- ì¼ë°˜ì ìœ¼ë¡œ **ëª©ì ì§€ ê°€ê¹Œìš´ ìª½** ì¸í„°í˜ì´ìŠ¤ì— ì ìš©

###  ì„¤ì • ì˜ˆì‹œ  
> 192.168.10.0/24 ë„¤íŠ¸ì›Œí¬ì—ì„œë§Œ ì ‘ê·¼ì„ í—ˆìš©í•˜ê³ , ë‚˜ë¨¸ì§€ëŠ” ì°¨ë‹¨

```bash
Router(config)# access-list 10 permit 192.168.10.0 0.0.0.255
Router(config)# access-list 10 deny any
Router(config)# interface fastEthernet 0/0
Router(config-if)# ip access-group 10 in
```

---

## [ì‹¤ìŠµ6-2] Extended Access List

###  íŠ¹ì§•
- **ì¶œë°œì§€ IP, ëª©ì ì§€ IP, í”„ë¡œí† ì½œ(TCP, UDP ë“±), í¬íŠ¸ ë²ˆí˜¸**ê¹Œì§€ ìƒì„¸í•˜ê²Œ ì œì–´í•¨
- ë²ˆí˜¸ ë²”ìœ„: **100~199** ë˜ëŠ” **2000~2699**
- ì¼ë°˜ì ìœ¼ë¡œ **ì¶œë°œì§€ ê°€ê¹Œìš´ ìª½** ì¸í„°í˜ì´ìŠ¤ì— ì ìš©

###  ì„¤ì • ì˜ˆì‹œ  
> 192.168.20.0/24 ë„¤íŠ¸ì›Œí¬ì—ì„œ ì¶œë°œí•œ HTTP(80ë²ˆ í¬íŠ¸) íŠ¸ë˜í”½ë§Œ í—ˆìš©í•˜ê³ , ë‚˜ë¨¸ì§€ëŠ” ì°¨ë‹¨

```bash
Router(config)# access-list 110 permit tcp 192.168.20.0 0.0.0.255 any eq 80
Router(config)# access-list 110 deny ip any any
Router(config)# interface fastEthernet 0/1
Router(config-if)# ip access-group 110 in
```
